InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаЦены</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыВРезервеНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРезервеНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.МаркировкаТоваровГИСМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыВЯчейках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВЯчейках</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПроблемнаяЯчейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыВСборке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВСборке</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Собрано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСобрано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КСборке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКСборке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныКорректировкиСборки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сборка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СборкаЗаказовПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЗаказыПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПоставщикам</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартийТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

WebServices/PriceManager/Ext/Module.bsl
Функция ПолучитьОстатки(КодыМДМ, КодыМДМСкладов = Неопределено, ДатаСостояния = Неопределено)

	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PriceManager", УровеньЖурналаРегистрации.Информация, , , "Веб-сервис:Запуск. ПолучитьОстатки");  
	
	СтруктураДанных = ПолучитьОстаткиПоСкладам(КодыМДМ, КодыМДМСкладов, ДатаСостояния);
			
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PriceManager", УровеньЖурналаРегистрации.Информация, , , "Веб-сервис:Завершение. ПолучитьОстатки " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат ОбщегоНазначения.ВернутьJSON(СтруктураДанных);

КонецФункции

Функция ПолучитьОстаткиПоСкладам(КодыМДМ, КодыМДМСкладов, ДатаСостояния = Неопределено)

	ДанныеСтруктура = ОбщегоНазначения.ВернутьСтруктуруИзJSON(КодыМДМ);
	КодыМДМ = ДанныеСтруктура.КодыМДМ;
	
	UploadInitiator = "WebService";
	
	Если ЗначениеЗаполнено(КодыМДМСкладов) Тогда
		
		ДанныеСтруктура = ОбщегоНазначения.ВернутьСтруктуруИзJSON(КодыМДМСкладов);
		КодыМДМСкладов = ДанныеСтруктура.КодыМДМСкладов;
		
	Иначе
		КодыМДМСкладов = Неопределено;	
	КонецЕсли;	
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("status", "");
	СтруктураДанных.Вставить("message", "");
	
	Если КодыМДМ.Количество() = 0 Тогда 		
		
		СтруктураДанных.status = "ERROR";
		СтруктураДанных.message = "Не заполнен массив кодов МДМ";
		Возврат СтруктураДанных;
		
	КонецЕсли;	
	
	Попытка
		
		AMQP_РаботаСДокументами_ver2.СформироватСообщенияПоСостояниюТоваровНаСкладах(КодыМДМ, КодыМДМСкладов, UploadInitiator, ДатаСостояния);
		СтруктураДанных.status = "OK";
		СтруктураДанных.message = "";	
		Возврат СтруктураДанных;
		
	Исключение
		
		СтруктураДанных.status = "ERROR";
		СтруктураДанных.message = "Не удалось создать исходящее сообщение для Раббита" + Символы.ПС + ОписаниеОшибки();
		Возврат СтруктураДанных;
		
	КонецПопытки;	

КонецФункции

Функция ПолучитьПТУ(КолвоДней = 3)

	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PriceManager", УровеньЖурналаРегистрации.Информация, , , "Веб-сервис:Запуск. ПолучитьПТУ");  
	
	СтруктураДанных = ПолучитьПТУНаСервере(ТекущаяДата(), КолвоДней);
			
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PriceManager", УровеньЖурналаРегистрации.Информация, , , "Веб-сервис:Завершение. ПолучитьПТУ " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат ОбщегоНазначения.ВернутьJSON(СтруктураДанных);

КонецФункции

Функция ПолучитьПТУНаСервере(ТекДата, КолвоДней)

	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("status", "");
	СтруктураДанных.Вставить("message", "");
	СтруктураДанных.Вставить("МассивДокументов", "");
		
	МассивДокументов = Новый Массив();
			
	ТабТовары = Новый ТаблицаЗначений(); 
	ТабТовары.Колонки.Добавить("Номенклатура");
	ТабТовары.Колонки.Добавить("КодПроизводителя");
	ТабТовары.Колонки.Добавить("Производитель");
	ТабТовары.Колонки.Добавить("Артикул");
	ТабТовары.Колонки.Добавить("Количество");
	ТабТовары.Колонки.Добавить("Цена");
	
	НачДата = ТекДата - 86400 * КолвоДней;	
	Запрос = Новый Запрос();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТовары.Ссылка КАК Ссылка,
	|	ПоступлениеТоваровУслугТовары.Ссылка.ШтампВерсии,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Организация.КодМДМ КАК Организация,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Дата КАК Дата,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Номер,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Контрагент.КодМДМ КАК Контрагент,
	|	ПоступлениеТоваровУслугТовары.Номенклатура.КодМДМ КАК Номенклатура,
	|	ПоступлениеТоваровУслугТовары.Номенклатура.КодПроизводителя КАК КодПроизводителя,
	|	ПоступлениеТоваровУслугТовары.Номенклатура.Родитель.Наименование КАК Производитель,
	|	ПоступлениеТоваровУслугТовары.Номенклатура.Артикул КАК Артикул,
	|	СУММА(ПоступлениеТоваровУслугТовары.Количество) КАК Количество,
	|	ПоступлениеТоваровУслугТовары.Цена
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И НЕ ПоступлениеТоваровУслугТовары.Ссылка.Контрагент = &Контрагент
	|	И ПоступлениеТоваровУслугТовары.Ссылка.Экспресс = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугТовары.Ссылка,
	|	ПоступлениеТоваровУслугТовары.Ссылка.ШтампВерсии,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Дата,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Номер,
	|	ПоступлениеТоваровУслугТовары.Номенклатура,
	|	ПоступлениеТоваровУслугТовары.Номенклатура.КодПроизводителя,
	|	ПоступлениеТоваровУслугТовары.Номенклатура.Родитель.Наименование,
	|	ПоступлениеТоваровУслугТовары.Номенклатура.Артикул,
	|	ПоступлениеТоваровУслугТовары.Цена,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Организация.КодМДМ,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Контрагент.КодМДМ,
	|	ПоступлениеТоваровУслугТовары.Номенклатура.КодМДМ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Ссылка,
	|	Номенклатура
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	Ссылка";
	
	Запрос.Параметры.Вставить("ДатаНач", НачалоДня(НачДата));
	Запрос.Параметры.Вставить("ДатаКон", КонецДня(ТекДата));
	Запрос.Параметры.Вставить("Контрагент", Константы.ОсновнойПоставщик.Получить());
	
	ВыборкаДокументы = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КолвоДокументов = ВыборкаДокументы.Количество();
	
	Если КолвоДокументов = 0 Тогда
		
		СтруктураДанных.status = "ERROR";
		СтруктураДанных.message = "Нет данных";		
		Возврат СтруктураДанных;
		
	Иначе
		
		СтруктураДанных.status = "OK";
		СтруктураДанных.message = "Количество документов: " + Строка(КолвоДокументов);
		
	КонецЕсли;	
	
	Пока ВыборкаДокументы.Следующий() Цикл
		
		СтруктураДокумента = СоздатьСтруктуруДокумента();
		ЗаполнитьЗначенияСвойств(СтруктураДокумента, ВыборкаДокументы); 
		СтруктураДокумента.ГУИД = Строка(ВыборкаДокументы.Ссылка.УникальныйИдентификатор());
		СтруктураДокумента.Организация = Строка(СтруктураДокумента.Организация);
		СтруктураДокумента.Контрагент = Строка(СтруктураДокумента.Контрагент);
		
		ТабТовары.Очистить();
		ВыборкаТовары = ВыборкаДокументы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаТовары.Следующий() Цикл
			
			СтрТовары = ТабТовары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрТовары, ВыборкаТовары);		
			
		КонецЦикла;		
		
		СтруктураДокумента.Товары = ТаблицуВМассив(ТабТовары);
		МассивДокументов.Добавить(СтруктураДокумента);		
		
	КонецЦикла;	
	
	СтруктураДанных.Вставить("МассивДокументов", МассивДокументов);
	
	Возврат СтруктураДанных;

КонецФункции

Функция ПолучитьЦены(КодыМДМ = "")

	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PriceManager", УровеньЖурналаРегистрации.Информация, , , "Веб-сервис:Запуск. ПолучитьЦены");  
	
	СтруктураДанных = ПолучитьЦеныНоменклатуры(КодыМДМ);
			
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PriceManager", УровеньЖурналаРегистрации.Информация, , , "Веб-сервис:Завершение. ПолучитьЦены " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат ОбщегоНазначения.ВернутьJSON(СтруктураДанных);

КонецФункции

Функция ПолучитьЦеныНоменклатуры(КодыМДМ)

	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("status", "");
	СтруктураДанных.Вставить("message", "");
	СтруктураДанных.Вставить("ТаблицаЦен", "");	
	
	Если ЗначениеЗаполнено(КодыМДМ) Тогда
		
		ДанныеСтруктура = ОбщегоНазначения.ВернутьСтруктуруИзJSON(КодыМДМ);
		КодыМДМ = ДанныеСтруктура.КодыМДМ;
		
		Если ЗначениеЗаполнено(КодыМДМ) Тогда		
			
			Если КодыМДМ.Количество() = 0 Тогда			
				КодыМДМ = "";			
			КонецЕсли;					
			
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(ЦеныНоменклатурыСрезПоследних.Номенклатура) КАК Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.КодМДМ КАК КодМДМ,
	|	ЦеныНоменклатурыСрезПоследних.Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&ТекДата,
	|			ТипЦен = &ТипЦен
	|				И ВЫБОР
	|					КОГДА &ОтборПоКодамМДМ = ИСТИНА
	|						ТОГДА Номенклатура.КодМДМ В (&КодыМДМ)
	|					ИНАЧЕ Номенклатура.ПометкаУдаления = ЛОЖЬ
	|							И Номенклатура.КодМДМ <> """"
	|				КОНЕЦ) КАК ЦеныНоменклатурыСрезПоследних";
	
	Запрос.Параметры.Вставить("ТекДата", ТекущаяДата());
	Запрос.Параметры.Вставить("КодыМДМ", КодыМДМ);
	Запрос.Параметры.Вставить("ТипЦен", Константы.ЦенаСебестоимость.Получить());
	Запрос.Параметры.Вставить("ОтборПоКодамМДМ", ?(ЗначениеЗаполнено(КодыМДМ), Истина, Ложь));	
	
	ТабЦен = Запрос.Выполнить().Выгрузить();
	КолвоСтрок = ТабЦен.Количество();
	
	Если КолвоСтрок = 0 Тогда
		
		СтруктураДанных.status = "ERROR";
		СтруктураДанных.message = "Нет данных";		
				
	Иначе
		
		СтруктураДанных.status = "OK";
		СтруктураДанных.message = "Количество строк: " + Строка(КолвоСтрок);
		СтруктураДанных.ТаблицаЦен = ТаблицуВМассив(ТабЦен);
		
	КонецЕсли;	
	
	Возврат СтруктураДанных;		

КонецФункции

Функция ПолучитьАктуальнуюНоменклатуру()
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PriceManager", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. ПолучитьАктуальнуюНоменклатуру");
	
	СтруктураДанных = ПолучитьАктуальнуюНоменклатуруСОстатками();
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PriceManager", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ПолучитьАктуальнуюНоменклатуру " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат ОбщегоНазначения.ВернутьJSON(СтруктураДанных);
	
КонецФункции

Функция ПолучитьАктуальнуюНоменклатуруСОстатками()

	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("status", "");
	СтруктураДанных.Вставить("message", "");
	СтруктураДанных.Вставить("ТаблицаНоменклатуры", "");

	Запрос = Новый Запрос();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура,
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ТоварыВРезерве
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|			,
	|			Склад = &Склад
	|				И ДокументРезерва ССЫЛКА Документ.ЗаказПокупателя
	|				И НЕ Номенклатура.КодМДМ = """") КАК ТоварыВРезервеНаСкладахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва,
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) КАК СвободныйОстатокСклад
	|ПОМЕСТИТЬ НеНулевыеСвободныеОстаткиСклад
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			,
	|			Склад = &Склад
	|				И НЕ Номенклатура.КодМДМ = """") КАК ТоварыНаСкладахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|				,
	|				Склад = &Склад
	|					И НЕ Номенклатура.КодМДМ = """") КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|ГДЕ
	|	ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) > 0
	|	И ТоварыНаСкладахОстатки.Номенклатура.Родитель.НеПоказыватьНаПортале = ЛОЖЬ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НеНулевыеСвободныеОстаткиСклад.Номенклатура КАК Номенклатура,
	|	НеНулевыеСвободныеОстаткиСклад.СвободныйОстатокСклад,
	|	ТоварыВЯчейкахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0) КАК СвободныйОстатокЯчейки,
	|	ВЫБОР
	|		КОГДА НеНулевыеСвободныеОстаткиСклад.СвободныйОстатокСклад <= ТоварыВЯчейкахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
	|			ТОГДА НеНулевыеСвободныеОстаткиСклад.СвободныйОстатокСклад
	|		ИНАЧЕ ТоварыВЯчейкахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
	|	КОНЕЦ КАК СвободныйОстаток
	|ПОМЕСТИТЬ НеНулевыеСвободныеОстатки
	|ИЗ
	|	НеНулевыеСвободныеОстаткиСклад КАК НеНулевыеСвободныеОстаткиСклад
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
	|				,
	|				Склад = &Склад
	|					И Ячейка.НеУчитыватьВОперативномУчете = ЛОЖЬ
	|					И НЕ Номенклатура.КодМДМ = """") КАК ТоварыВЯчейкахОстатки
	|		ПО НеНулевыеСвободныеОстаткиСклад.Номенклатура = ТоварыВЯчейкахОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|				,
	|				Склад = &Склад
	|					И НЕ Номенклатура.КодМДМ = """") КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО (ТоварыВЯчейкахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки(
	|				,
	|				(ЗаказПокупателя, Номенклатура) В
	|					(ВЫБРАТЬ
	|						ТоварыВРезерве.ЗаказПокупателя КАК ЗаказПокупателя,
	|						ТоварыВРезерве.Номенклатура
	|					ИЗ
	|						ТоварыВРезерве КАК ТоварыВРезерве)) КАК ТоварыВСборкеОстатки
	|		ПО (ТоварыВЯчейкахОстатки.Номенклатура = ТоварыВСборкеОстатки.Номенклатура)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таб.Номенклатура
	|ПОМЕСТИТЬ ОборотСегодня
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыНаСкладахОбороты.Номенклатура КАК Номенклатура
	|	ИЗ
	|		РегистрНакопления.ТоварыНаСкладах.Обороты(
	|				&НачалоСегодняшнегоДня,
	|				,
	|				,
	|				Склад = &Склад
	|					И НЕ Номенклатура В
	|							(ВЫБРАТЬ
	|								НеНулевыеСвободныеОстатки.Номенклатура
	|							ИЗ
	|								НеНулевыеСвободныеОстатки КАК НеНулевыеСвободныеОстатки)
	|					И НЕ Номенклатура.КодМДМ = """") КАК ТоварыНаСкладахОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ТоварыВРезервеНаСкладахОбороты.Номенклатура
	|	ИЗ
	|		РегистрНакопления.ТоварыВРезервеНаСкладах.Обороты(
	|				&НачалоСегодняшнегоДня,
	|				,
	|				,
	|				Склад = &Склад
	|					И НЕ Номенклатура В
	|							(ВЫБРАТЬ
	|								НеНулевыеСвободныеОстатки.Номенклатура
	|							ИЗ
	|								НеНулевыеСвободныеОстатки КАК НеНулевыеСвободныеОстатки)
	|					И НЕ Номенклатура.КодМДМ = """") КАК ТоварыВРезервеНаСкладахОбороты) КАК Таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбщаяТабл.Номенклатура.КодМДМ КАК КодМДМ,
	|	СУММА(ЕСТЬNULL(ОбщаяТабл.СвободныйОстаток, 0)) КАК СвободныйОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		НеНулевыеСвободныеОстатки.Номенклатура КАК Номенклатура,
	|		НеНулевыеСвободныеОстатки.СвободныйОстаток КАК СвободныйОстаток
	|	ИЗ
	|		НеНулевыеСвободныеОстатки КАК НеНулевыеСвободныеОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОборотСегодня.Номенклатура,
	|		0
	|	ИЗ
	|		ОборотСегодня КАК ОборотСегодня
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗаказыПоставщикамОстатки.Номенклатура,
	|		0
	|	ИЗ
	|		РегистрНакопления.ЗаказыПоставщикам.Остатки(, НЕ Номенклатура.КодМДМ = """") КАК ЗаказыПоставщикамОстатки) КАК ОбщаяТабл
	|ГДЕ
	|	ОбщаяТабл.Номенклатура.ВидНоменклатуры = &ВидНоменклатуры
	|	И НЕ ОбщаяТабл.Номенклатура.КодМДМ = """"
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбщаяТабл.Номенклатура.КодМДМ";

	Запрос.УстановитьПараметр("Склад", Константы.ОсновнойСклад.Получить());
	Запрос.УстановитьПараметр("ВидНоменклатуры", Константы.ВидНоменклатурыПоУмолчанию.Получить());
	Запрос.УстановитьПараметр("НачалоСегодняшнегоДня", НачалоДня(ТекущаяДата()));
	
	ТабНоменклатуры = Запрос.Выполнить().Выгрузить();
	КолвоСтрок = ТабНоменклатуры.Количество();
	
	Если КолвоСтрок = 0 Тогда
		
		СтруктураДанных.status = "ERROR";
		СтруктураДанных.message = "Нет данных";		
				
	Иначе
		
		СтруктураДанных.status = "OK";
		СтруктураДанных.message = "Количество строк: " + Строка(КолвоСтрок);
		СтруктураДанных.ТаблицаНоменклатуры = ТаблицуВМассив(ТабНоменклатуры);
		
	КонецЕсли;	
	
	Возврат СтруктураДанных;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция СоздатьСтруктуруДокумента()

	СтруктураДокумента = Новый Структура();
	СтруктураДокумента.Вставить("ГУИД", "");
	СтруктураДокумента.Вставить("ШтампВерсии", "");
	СтруктураДокумента.Вставить("Организация", "");
	СтруктураДокумента.Вставить("Дата", "");
	СтруктураДокумента.Вставить("Номер", "");
	СтруктураДокумента.Вставить("Контрагент", "");
	СтруктураДокумента.Вставить("Товары", "");
	
	Возврат СтруктураДокумента;
	
КонецФункции

Функция ТаблицуВМассив(Таблица)

	МассивДанных = Новый Массив;
	
	Для Каждого ТекСтрока Из Таблица Цикл
		
		СтруктураДанных = Новый Структура;
		
		Для Каждого Колонка ИЗ Таблица.Колонки Цикл
			
			Если ЭтоСсылка(ТекСтрока[Колонка.Имя]) Тогда
				
				Если Колонка.Имя = "Ссылка" Тогда
					СтруктураДанных.Вставить(Колонка.Имя, ?(ТекСтрока[Колонка.Имя] = NULL, "", Строка(ТекСтрока[Колонка.Имя].УникальныйИдентификатор())));
				Иначе
					
					Если ТипЗнч(ТекСтрока[Колонка.Имя]) = Тип("Массив") Тогда
						СтруктураДанных.Вставить(Колонка.Имя, ТекСтрока[Колонка.Имя]);
					Иначе
						СтруктураДанных.Вставить(Колонка.Имя, Строка(ТекСтрока[Колонка.Имя]));
					КонецЕсли;
					
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(ТекСтрока[Колонка.Имя]) = Тип("Дата") Тогда
				СтруктураДанных.Вставить(Колонка.Имя, Строка(ТекСтрока[Колонка.Имя]));
			Иначе
				СтруктураДанных.Вставить(Колонка.Имя, ТекСтрока[Колонка.Имя]);
			КонецЕсли;
			
		КонецЦикла;
		
		МассивДанных.Добавить(СтруктураДанных);
		
	КонецЦикла;         
	
	Возврат МассивДанных;

КонецФункции

Функция ЭтоСсылка(Значение)

	Если ТипЗнч(Значение) = Тип("Число") ИЛИ ТипЗнч(Значение) = Тип("Строка") ИЛИ ТипЗнч(Значение) = Тип("Дата") ИЛИ ТипЗнч(Значение) = Тип("Булево") Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции
